Taxi/test_selfemployed_fns_proxy/fns_message_templates/fns_auth_request.xml

<?xml version='1.0' encoding='utf-8'?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
  <soap-env:Body>
    <ns0:GetMessageRequest xmlns:ns0="urn://x-artefacts-gnivc-ru/inplat/servin/OpenApiMessageConsumerService/types/1.0">
      <ns0:Message>
        <ns1:AuthRequest xmlns:ns1="urn://x-artefacts-gnivc-ru/ais3/kkt/AuthService/types/1.0">
          <ns1:AuthAppInfo>
            <ns1:MasterToken>{secret}</ns1:MasterToken>
          </ns1:AuthAppInfo>
        </ns1:AuthRequest>
      </ns0:Message>
    </ns0:GetMessageRequest>
  </soap-env:Body>
</soap-env:Envelope>
